<script setup lang="ts" name="ThRule2"></script>

<template>
  <div
    style="
      background: #262d34;
      color: rgba(255, 255, 255, 0.6);
      font-size: 14px;
      padding: 24px;
    "
  >
    <div
      style="display: flex; align-items: center; color: #fff; font-size: 16px"
    >
      <div
        style="
          width: 24px;
          line-height: 24px;
          text-align: center;
          border-radius: 8px;
          flex-shrink: 0;
          background: #000;
          margin-right: 12px;
        "
      >
        一
      </div>
      <div>เดิมพันสด</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      การเดิมพันสด หมายถึง การเดิมพันในเกมต่อเนื่อง
      การเดิมพันจะยังคงได้รับการยอมรับในระหว่างเกมและจะหยุดเมื่อตลาดปิด
      หมายเหตุ: ไม่ว่าเหตุการณ์จะเริ่มต้นขึ้นหรือไม่ก็ตาม
      ตราบใดที่ตลาดแสดงเป็นสด ระบบจะติดแท็กเดิมพันทั้งหมดเป็นเดิมพันสด
    </div>
    <div style="padding: 14px 14px 14px 40px">
      1. การเดิมพันสดทั้งหมดขึ้นอยู่กับกระบวนการยอมรับของระบบ
      ซึ่งอาจส่งผลให้การยืนยันหรือปฏิเสธการเดิมพันล่าช้า
    </div>
    <div style="padding: 14px 14px 14px 40px">
      2.
      การเดิมพันทั้งหมดจะผ่านกระบวนการยอมรับของระบบภายในเวลาที่กำหนดเพื่อตัดสินว่าการเดิมพันสำเร็จหรือไม่
      กระบวนการนี้จะส่งผลให้มีการยืนยันหรือยกเลิกการเดิมพันดังกล่าว
    </div>
    <div style="padding: 14px 14px 14px 40px">
      3. ในกรณีที่เกิดปัญหาทางเทคนิคหรือเหตุไม่คาดฝันอื่นๆ ระหว่างการแข่งขัน
      การเดิมพันที่รอดำเนินการทั้งหมดจะไม่ได้รับการยืนยันและจะถูกปฏิเสธ
    </div>

    <div
      style="display: FLEX; align-items: CENTER; color: #fff; font-size: 16px"
    >
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: CENTER;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        二
      </div>
      <div>การตัดสินการเดิมพันสด</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      เกมไม่สามารถเล่นหรือเล่นซ้ำได้เนื่องจากสถานการณ์ที่ไม่คาดฝันหรือเหตุสุดวิสัย
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ก.
      ในกรณีที่ไม่สามารถเล่นเกมได้เนื่องจากเหตุสุดวิสัยหรือเหตุสุดวิสัยในแผนที่เดียว
      ผลการตัดสินทั้งหมดจะยังคงใช้ได้ในขณะที่เดิมพันผลที่ยังไม่แน่ชัดจะได้รับเงินคืน
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ข.
      ในกรณีที่เกมถูกเล่นซ้ำเนื่องจากสถานการณ์ที่ไม่คาดฝันหรือเหตุสุดวิสัยบนแผนที่เดียว
      ผลการตัดสินทั้งหมดจะยังคงมีผลและการเดิมพันผลที่ยังไม่แน่ชัดจะขึ้นอยู่กับผลของการแข่งขัน
      /map จะถือว่าแยกจากกัน
      ดังนั้นการเดิมพันสดที่ได้รับผลกระทบจะถูกยกเลิกและคืนเงิน
    </div>
    <!-- 叶尾 -->
  </div>
</template>
