<script setup lang="ts" name="ThRule0"></script>

<template>
  <div
    style="
        background: #262d34;
        color: rgba(255, 255, 255, 0.6);
        font-size: 14px;
        padding: 24px;
      "
  >
    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        1
      </div>
      <div>วันที่และเวลาเริ่มต้น</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      วันที่และเวลาเริ่มต้นของกิจกรรม e-sports ที่แสดงบนแพลตฟอร์มมีไว้เพื่อการอ้างอิงเท่านั้น เวลาเริ่มต้นที่เฉพาะเจาะจงจะขึ้นอยู่กับการแสดงอย่างเป็นทางการ หากเกมถูกระงับหรือเลื่อนออกไป และไม่มีการประกาศเวลาเริ่มต้นภายใน 12 ชั่วโมงนับจาก เวลาเริ่มต้นเดิมหรือไม่ หากเกมเริ่มใหม่ภายใน 24 ชั่วโมง การเดิมพันในเกมนั้นจะถือว่าไม่ถูกต้องและเงินต้นจะได้รับการคืนเงิน
    </div>

    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        2
      </div>
      <div>ข้อมูลผลการแข่งขันหมดเวลา</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ในกรณีที่ไม่มีผลการแข่งขันอย่างเป็นทางการภายใน 12 ชั่วโมงหลังจากเวลาเริ่มต้นจริง
      หรือไม่มีข้อมูลอย่างเป็นทางการเกี่ยวกับการแข่งขันดังกล่าว การเดิมพันทั้งหมดจะถือเป็นโมฆะและจะได้รับเงินคืน
    </div>

    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        3
      </div>
      <div>สถานการณ์พิเศษเกี่ยวกับทีมและผู้เล่น</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ก. ในกรณีที่สะกดชื่อผู้เล่น/ทีมผิด การเดิมพันทั้งหมดยังถือว่ามีผล เว้นแต่ชื่อผู้เล่นหรือทีมจะไม่ถูกต้องอย่างชัดเจน
      หากผู้เล่นเข้าร่วมการแข่งขันใช้นามแฝงหรือชื่อบัญชีอื่น การเดิมพันทั้งหมดจะถือว่าใช้ได้
      หากมีผู้เล่นที่ไม่เป็นทางการเล่นภายใต้ทีม (หรือหนึ่งในนั้น)
      ของทีมและไม่มีการประกาศอย่างเป็นทางการเกี่ยวกับการเปลี่ยนแปลง
      เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพันทั้งหมดและคืนเงินให้
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ข. ในกรณีที่ทีมไม่สามารถเข้าร่วมได้เนื่องจากสาเหตุหลายประการ การเดิมพันทั้งหมดจะถือเป็นโมฆะและจะได้รับเงินคืน
    </div>

    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        4
      </div>
      <div>การแก้ไขหรือเปลี่ยนแปลงผลการแข่งขัน</div>
    </div>

    <div style="padding: 14px 14px 14px 40px">
      ก. สำหรับการเดิมพันที่ตัดสินแล้ว ในกรณีที่มีการแก้ไขหรือเปลี่ยนแปลงผลการแข่งขันภายใน 36
      ชั่วโมงนับจากเริ่มการแข่งขัน เราขอสงวนสิทธิ์ในการแก้ไขหรือแก้ไขผลการแข่งขันเหล่านี้
      ผลการแข่งขันจะถูกกำหนดตามแหล่งที่มาที่เกี่ยวข้อง รวมถึงหน้าสถิติ/คะแนนอย่างเป็นทางการ
      หรือการถ่ายทอดสดสตรีมแบบสดอย่างเป็นทางการ (การบันทึกวิดีโอ)
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ข. สำหรับผลการแข่งขัน ในกรณีที่ผลการแข่งขันมีการเปลี่ยนแปลงหลังจากผ่านไปมากกว่า 36 ชั่วโมง
      ผู้เล่นจะต้องค้นหาและอ้างอิงเว็บไซต์ของกิจกรรมอย่างเป็นทางการสำหรับผลการแข่งขันที่ถูกต้อง
      แพลตฟอร์มจะสงวนสิทธิ์ในการคงไว้ซึ่งการตัดสินผลการแข่งขันเดิม
    </div>
    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        5
      </div>
      <div>เมื่อมีความขัดแย้งระหว่างผลการแข่งขันอย่างเป็นทางการกับผลการแข่งขันที่ประกาศบนเว็บไซต์แพลตฟอร์ม</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      เมื่อมีข้อขัดแย้งระหว่างผลการแข่งขันอย่างเป็นทางการกับผลการแข่งขันที่เผยแพร่บนเว็บไซต์ของแพลตฟอร์มนี้
      ผลการแข่งขันที่ถูกต้องควรถูกกำหนดโดยอ้างอิงจากบันทึกวิดีโอของเหตุการณ์ที่เกี่ยวข้องบนแพลตฟอร์มนี้เพื่อแก้ไขข้อขัดแย้ง
      อย่างไรก็ตาม
      ในกรณีที่ไม่มีการบันทึกวิดีโอที่ใช้บังคับดังกล่าวผลการแข่งขันที่ถูกต้องจะถูกกำหนดตามผลการแข่งขันที่เผยแพร่บนเว็บไซต์อย่างเป็นทางการขององค์กรเจ้าภาพที่เกี่ยวข้องของเหตุการณ์ที่เกี่ยวข้องหากเว็บไซต์อย่างเป็นทางการไม่สามารถให้ผลการแข่งขันนี้หรือผลการแข่งขันที่เผยแพร่บนเว็บไซต์อย่างเป็นทางการมีข้อผิดพลาดอย่างเห็นได้ชัด
      แพลตฟอร์มมีสิทธิ์ตัดสินใจ/แก้ไขเพื่อตัดสินผลการแข่งขันขั้นสุดท้าย ในการนี้
      การตัดสินของแพลตฟอร์มนี้ถือเป็นที่สิ้นสุดและเด็ดขาด
    </div>
    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        6
      </div>
      <div>เดิมพันล่าช้า</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      หากด้วยเหตุผลใดก็ตาม การเดิมพันก่อนการแข่งขันได้รับการยอมรับหลังจากการแข่งขันเริ่มต้นขึ้น
      จะถือว่าเป็นการเดิมพันล่าช้า หากตลาดสำหรับการเดิมพันสดไม่ปิดก่อนเวลาที่กำหนด
      การเดิมพันที่วางหลังจากเวลาที่กำหนดจะถือเป็นการเดิมพันล่าช้า
      เราขอสงวนสิทธิ์ในการยกเลิกการเดิมพันดังกล่าวและดำเนินการคืนเงิน
    </div>
    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        7
      </div>
      <div>ผู้จัดการแข่งขันทำการเปลี่ยนแปลงรูปแบบการแข่งขัน</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      หากผู้จัดเปลี่ยนแปลงระบบการแข่งขันชั่วคราวในระหว่างการแข่งขันนี้ ซึ่งไม่เหมือนกับระบบการแข่งขันเดิม
      การเดิมพันในตลาดทั้งหมดจะถือเป็นโมฆะและจะได้รับเงินคืน คำนวณแบบปกติเกมส์เดียว
    </div>
    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        8
      </div>
      <div>เหตุการณ์ไม่คาดฝันหรือสถานการณ์พิเศษ</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ในกรณีที่มีข้อผิดพลาดหรือปัญหาทางเทคนิคในระยะสั้นระหว่างการแข่งขัน
      ผลของการแข่งขันจะตัดสินตามผลการแข่งขันขั้นสุดท้ายอย่างเป็นทางการ

      。
    </div>
    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        9
      </div>
      <div>เกี่ยวกับการเดิมพันกีฬา</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      สำหรับฟุตบอล/ฟุตบอล คะแนนสุดท้ายจะคิดตามแบบเต็มเวลา (รวมเวลาบาดเจ็บ)
      คะแนนที่ได้รับในช่วงต่อเวลาพิเศษและลูกจุดโทษจะไม่นับรวม สำหรับบาสเก็ตบอล
      คะแนนสุดท้ายจะอิงตามเวลาปกติรวมทั้งช่วงต่อเวลา ตำแหน่งของทีมเหย้าและทีมเยือนอาจแตกต่างจากที่แสดงไว้
    </div>
    <div style="display: flex; align-items: center; color: #fff; font-size: 16px">
      <div
        style="
            width: 24px;
            line-height: 24px;
            text-align: center;
            border-radius: 8px;
            flex-shrink: 0;
            background: #000;
            margin-right: 12px;
          "
      >
        10
      </div>
      <div>อื่นๆ</div>
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ก. เราขอสงวนสิทธิ์ในการระงับตลาดและ/หรือยกเลิกการเดิมพันใด ๆ ได้ตลอดเวลา
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ข. ในกรณีที่สตรีมวิดีโอผิดจะไม่สามารถเล่นสตรีมวิดีโอได้ ฯลฯ ข้อตกลงจะไม่ได้รับผลกระทบแต่อย่างใด
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ค. การใช้ช่องโหว่ของระบบในการเดิมพัน การใช้เว็บไซต์ที่ไม่เป็นทางการในการวางเดิมพัน การสมรู้ร่วมคิด
      หรือการเดิมพันที่น่าสงสัยอื่นๆ เราขอสงวนสิทธิ์ในการจัดการเรื่องดังกล่าว
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ง. เมื่อเดิมพันได้รับการยืนยันแล้ว จะไม่สามารถยกเลิก เพิกถอน หรือเปลี่ยนแปลงได้
      และใบเดิมพันจะถือเป็นหลักฐานที่ถูกต้องสำหรับการเดิมพันของคุณภายใต้การตรวจสอบโดยแพลตฟอร์มนี้
    </div>
    <div style="padding: 14px 14px 14px 40px">
      จ. ในกรณีที่ระบบ/ข้อผิดพลาดทางเทคนิคทำให้แสดงราคาต่อรองไม่ถูกต้อง
      เดิมพันทั้งหมดที่วางในช่วงเวลาที่มีการแสดงอัตราต่อรองที่ไม่ถูกต้องจะถือเป็นโมฆะ
      หากเกิดข้อผิดพลาดเดียวกันระหว่างการเดิมพันสด เราขอสงวนสิทธิ์ในการยกเลิกการวางเดิมพันและออกเงินคืน
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ฉ. ในกรณีที่ระบบของเราทำให้เกิดข้อผิดพลาดหรือทำงานผิดพลาด การเดิมพันทั้งหมดจะถือเป็นโมฆะ
      กรุณาแจ้งให้เราทราบทันที
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ช. วิดีโอที่ออกอากาศและข้อมูลที่แสดงทั้งหมด (เช่น วันที่ เวลา คะแนน สถิติ ข่าว ฯลฯ) ใช้สำหรับอ้างอิงเท่านั้น
      เราไม่รับผิดชอบต่อความถูกต้องของข้อมูลดังกล่าว
    </div>
    <div style="padding: 14px 14px 14px 40px">
      ซ. เราขอสงวนสิทธิ์ในการเรียกคืนจำนวนเงินที่ชำระเกินและทำการปรับเปลี่ยนดังกล่าวในบัญชีของคุณ
      ภายในขอบเขตที่เหมาะสม
      เราจะมีการตัดสินใจขั้นสุดท้ายและขอสงวนสิทธิ์ในการแก้ไขข้อกำหนดและเงื่อนไขเหล่านี้ได้ตลอดเวลาโดยไม่ต้อง
      แจ้งล่วงหน้า
    </div>
    <!-- 叶尾 -->
  </div>
</template>
